vf3D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoDarcyFoam;

startFrom       startTime;

startTime       0.0;

stopAt          endTime;

endTime         3;

deltaT          0.01;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     binary;

writePrecision  8;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

adjustTimeStep  yes;

runTimeModifiable yes;

maxDeltaT	100;
MaxCo            1.;

// ************************************************************************* //
